testEdo/3D/combustorRhoPimple2/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 900;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 900;
    }
    outlet
    {
        type            zeroGradient;
    }
    outerWalls
    {
        type            zeroGradient;
    }
    "(splitterFront|splitterRear|splitterBottom|splitterRight|splitterLeft|splitterTop)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
